import React from 'react';
import Card from '../components/card';

const ContentFirst = (index) => {
  return (
    <div key={index}>
      <p className='is-size-5 has-text-weight-light sm-mgb-20'>
        <strong>Samart Edu-Care Nursery </strong>บ้านหลังที่สองที่ให้ความรัก ความอบอุ่น
        พร้อมเสริมสร้างพัฒนาการที่เหมาะสมตามวัยทุกๆวัน{' '}
        <strong>“เก่งฉลาด ดึงศักยภาพ สู่อัจฉริยะ” </strong>
        ด้วยการเล่นอย่างมีความหมาย ภายใต้การดูแลด้านสุขภาพอนามัย ความปลอดภัย และโภชนาการที่ถูกต้อง
        โดย นพ. สามารถ จำปี ดูแลและส่งเสริมพัฒนาการด้วยสื่อที่เป็นรูปธรรม โดย คุณครูเอกปฐมวัย
        คุรุศาสตร์บัณฑิต โดยใช้แผนการเรียนรู้และเสริมพัฒนาการที่เน้นเด็กเป็นศูนย์กลาง
        โดยส่งเสริมให้เด็กมีพัฒนาการทั้งด้านร่างกาย อารมณ์ จิตใจ และสติปัญญาแบบองค์รวม
      </p>
      <p className='is-size-3 has-text-weight-light sm-mgb-20'>
        สามารถ เอ็ดดู แคร์ เนอสเซอรี่ ยังได้นำหลักสูตรการพัฒนาเด็กจากออสเตรเลียมาผสมผสาน
        เพื่อให้เด็กคุ้นเคยกับทั้งภาษาอังกฤษและภาษาไทยเพื่อจะได้นำไปใช้เมื่อเรียนชั้นสูงต่อไป
      </p>
      <p className='is-size-5 has-text-weight-light sm-mgb-20'>
        <strong>สามารถ เอ็ดดู แคร์ เนอสเซอรี่ </strong>มุ่งเน้นในการพัฒนาเด็ก
        โดยการจัดกิจกรรมการเรียนรู้บนพื้นฐานของความรัก การให้กำลังใจ การเสริมแรงในทางบวก
        และเน้นการจัดให้เกิดการเรียนรู้ผ่านภาวะคลื่นสมองต่ำ เพื่อให้เกิดการเรียนรู้อย่างมีสมาธิ
        มีความสุขในการรับรู้ ได้รับการพัฒนาทั้งร่างกายสมองซีกซ้าย สมองซีกขวา ประสาทสัมผัส
        จิตใต้สำนึก จิตเหนือสำนึก ควบคู่ไปกับการได้รับการพัฒนาจิต ปัญญา
        และการเรียนรู้อย่างสนุกสนานและมีความสุข นอกจากนี้ สามารถ เอ็ดดู แคร์ เนอสเซอรี่
        ยังได้ใช้ทฤษฎีการเรียนรู้เพื่อพัฒนาการทำงานของสมอง
        มาผสมผสานโดยได้จัดกิจกรรมส่งเสริมพัฒนาการที่เน้นเด็กเป็นสำคัญ ใช้พื้นฐานทฤษฎีการเรียนรู้
        และการทำงานของสมองเป็นฐานของการกำหนดรูปแบบการจัดกิจกรรม
        ซึ่งหลักในการจัดกิจกรรมในการพัฒนาเด็ก คือ
      </p>

      <ol className='is-size-5 has-text-weight-normal sm-mgb-20 sm-pdl-20'>
        <li>กระตุ้นให้เด็กมีการปฏิบัติการคิด (Active learning)</li>
        <li>กระตุ้นให้เด็กมีการแสดงออกระหว่างเรียน (Behaving)</li>
        <li>การเรียนแบบร่วมมือ (Cooperative learning)</li>
        <li>ให้มีการเรียนรู้จากการค้นพบ (Discovery learning)</li>
        <li>ให้เกิดความก้าวหน้า (Progress)</li>
      </ol>
      <p className='is-size-3 has-text-weight-light sm-mgb-20'>
        สามารถ เอ็ดดู แคร์ เนอสเซอรี่ ได้กระตุ้นและส่งเสริมพัฒนาการ
        และการเรียนรู้ผ่านการจัดกิจกรรมทหลากหลาย
      </p>
      <p className='is-size-5 has-text-weight-light sm-mgb-20'>
        <strong>สามารถ เอ็ดดู แคร์ เนอสเซอรี่ </strong>ได้กระตุ้นและส่งเสริมพัฒนาการ
        และการเรียนรู้ผ่านการจัดกิจกรรมทหลากหลาย โดยใช้สื่ออุปกรณ์ที่เหมาะสม
        และตรงกับพัฒนาการของเด็กแต่ละวัย และใช้วิธีการที่เป็นรูปธรรม เด็กสามารถจับต้องได้ คิดได้
        เด็กก็จะเกิดการเรียนรู้ที่ดี เด็กจะสนุกกับการเรียนรู้ศักยภาพทางสมองก็จะพัฒนาได้อย่างรวดเร็ว
        พร้อมที่จะเรียนรู้ในระดับสูงต่อไปด้วยตัวบุตรหลานท่านเองอย่างมีคุณภาพ
        เราได้เปิดโอกาสให้เด็กแต่ละคนได้พัฒนาตนเองตามลำดับขั้น
        เพื่อให้เด็กมีวุฒิภาวะตามวัยอย่างสมบรูณ์ ทั้งมีปัญญาดีและจิตใจดี
        และมีพัฒนาการสูงสุดตามศักยภาพและนำมาใช้ในชีวิตประจำวันได้อย่างมีความสุข
        พร้อมที่จะมีศักยภาพเป็นผู้ใหญ่ที่เก่ง ดี และมีความสุขในอนาคตต่อไป
      </p>
    </div>
  );
};

const ContentSecond = (index) => {
  return (
    <div key={index}>
      <p className='is-size-5 has-text-weight-light sm-mgb-20'>
        <strong>จุดประสงค์ของเรา :</strong>
      </p>

      <ol className='is-size-5 has-text-weight-light sm-mgb-20 sm-pdl-20'>
        <li>อบรมเลี้ยงดูเด็กด้วยความรัก ความอบอุ่น มีเมตตาและเข้าใจเด็ก</li>
        <ul>
          <li>
            - ดูแลสุขภาพอนามัย และตอบสนองความต้องการพื้นฐานทางร่างกายและจิตใจ
            รวมทั้งปกป้องคุ้มครองเด็ก ให้ปลอดภัย
          </li>
          <li>- เน้นถึงโภชนาการที่ถูกต้องและเหมาะสมสำหรับเด็ก</li>
          <li>
            - ดูแลฝึกปฏิบัติ กิจวัตรประจำวันสำหรับเด็ก เช่น ดูแลการรับประทานอาหาร การนอน การขับถ่าย
          </li>
        </ul>
        <li>พัฒนาเด็กแบบองค์รวม ทั้งร่างกาย อารมณ์ จิตใจ สังคม และสติปัญญา อย่างสมดุล</li>
        <li>
          ส่งเสริมการค้นพบปัญหา และการแก้ปัญหาในการเรียนรู้
          โดยการจัดประสบการณ์ผ่านกิจกรรมการเล่นที่หลากหลาย โดยคำนึงถึงความแตกต่างของแต่ละบุคคล
        </li>
        <li>
          เรียนรู้ตามธรรมชาติ และศักยภาพภายใต้วิถีชีวิตของเด็กตามจริงของชุมชน สังคม และวัฒนธรรมไทย
          เพื่อปลูกฝังให้เด็กมีคุณธรรม จริยธรรม และมีคุณสมบัติที่พึงประสงค์ตามวัย
        </li>
        <li>
          เพื่อให้เด็กได้รับการพัฒนาให้เป็นผู้ใหญ่ที่มีคุณภาพ และมีคุณค่าทั้งต่อตนเองและสังคม
          โดยผ่านการจัดประสบการณ์ตามแนวคิดที่ผสมผสานระหว่าง นีโอฮิวแมนนิส และ แนวคิดจิตปัญญา
        </li>
        <li>
          มุ่งเน้นดูแลและประเมินพัฒนาการของเด็กเป็นสำคัญ โดยมุ่งประเมิน พัฒนาการตามวัย
          ศักยภาพเด่นของเด็ก
        </li>
        <li>มุ่งเน้นแก้ไขดูแลพฤติกรรมเด็กที่มีปัญหา ปัญหาของเด็ก การเรียนรู้ของเด็ก</li>
      </ol>
      <p className='is-size-5 has-text-weight-light sm-mgb-20'>
        <strong>หลักในการจัดกิจกรรมของเราในแต่ละวัน :</strong>
      </p>
      <ol className='is-size-5 has-text-weight-light sm-mgb-20 sm-pdl-20'>
        <li>
          งานศิลปะที่ทำด้วยตัวเอง เด็กจะเกิดการเรียนรู้ด้วยตัวเอง และได้รับการพัฒนากล้ามเนื้อมัดเล็ก
          พัฒนาด้านอารมณ์ สังคมและจิตใจ พัฒนาการประสานสัมพันธ์กล้ามเนื้อมือและตา
        </li>
        <li>
          พัฒนาทักษะสำคัญต่างๆผ่านการเล่น เด็กจะเกิดการเรียนรู้ทักษะสำคัญต่างๆเช่น ทักษะประสาทสัมผัส
          ทักษะภาษา คณิตศาสตร์ วิทยาศาสตร์ รวมทั้งทักษะชีวิตผ่านการเล่น
          ซึ่งเด็กจะสนุกสนานเพลิดเพลินตามวัย ทำให้เกิดการสร้างสรรค์ปัญญาบนฐานของความสุข
        </li>
        <li>จัดทำให้เกิดการเรียนรู้โดยเน้นเด็กเป็นสำคัญ</li>
        <li>
          จัดกิจกรรมเพื่อให้เด็กได้รับการพัฒนาทั้งร่างกาย อารมณ์ สังคม จิตใจ และสติปัญญาแบบองค์รวม
          โดยใช้สื่ออุปกรณ์ที่เหมาะสมกับวัย
        </li>
        <li>เปิดโอกาสให้เด็กเกิดการเรียนรู้ผ่านการค้นพบ ตามศักยภาพของเด็กแต่ละคน</li>
        <li>
          จัดกิจกรรมเพี่อส่งเสริมให้เด็กได้เรียนรู้เกี่ยวกับ ตัวเลข รูปร่าง สี และภาษา
          โดยสื่อและอุปกรณ์ ที่เหมาะสมตามวัย
        </li>
        <li>กิจกรรมในแต่ละวันจะกระตุ้นให้เด็กคิดเอง พูดเอง ค้นพบและค้นคว้าด้วยตัวเอง</li>
        <li>
          พัฒนาเด็กผ่านการจัดสภาพแวดล้อมที่สนุกสนานด้วย เพลง นิทาน เกม และศิลปะ
          ซึ่งเน้นให้เหมาะสมกับพัฒนาการในแต่ละวัย
        </li>
      </ol>
    </div>
  );
};

const ContentThird = (index) => {
  const personList = [
    { img: '/img/man.svg', desc: 'นายแพทย์ สามารถ จำปี' },
    { img: '/img/woman.svg', desc: '' },
    { img: '/img/woman.svg', desc: '' },
    { img: '/img/woman.svg', desc: '' },
  ];
  return (
    <div key={index} className='columns'>
      {personList.map((item, index) => {
        return (
          <div key={index} className='column sm-center'>
            <Card key={index} img={item.img} desc={item.desc} fixImg={true} />
          </div>
        );
      })}
    </div>
  );
};

export default function About() {
  const subMenuListInit = [
    { id: 1, name: 'รู้จักกับเรา', active: true, content: ContentFirst },
    { id: 2, name: 'ปรัชญาและวิสัยทัศน์', active: false, content: ContentSecond },
    { id: 3, name: 'แนะนำบุคลากร', active: false, content: ContentThird },
  ];

  const [subMenuList, setSubMenuList] = React.useState(subMenuListInit);

  const onChangeView = (id) => {
    const _subMenuList = subMenuList.map((item) => {
      if (item.id === id) {
        item.active = true;
      } else {
        item.active = false;
      }
      return item;
    });

    setSubMenuList(_subMenuList);
  };

  return (
    <section className='hero is-medium sm-hero'>
      <div className='hero-body'>
        <div className='container'>
          <div className='is-size-1 sm-center sm-mgb-20'>
            <span className='sm-text-color-primary'>About</span>{' '}
            <span className='sm-text-color-tertiary'>Us</span>
          </div>
          <div className='columns'>
            <div className='column is-one-quarter'>
              {subMenuList.map((item, index) => {
                const localClass = item.active
                  ? 'sm-sub-menu is-size-4 sm-sub-menu-active'
                  : 'sm-sub-menu is-size-4';
                return (
                  <div key={index} className={localClass} onClick={() => onChangeView(item.id)}>
                    {item.name}
                  </div>
                );
              })}
            </div>
            <div className='column'>
              {subMenuList
                .filter((item) => item.active)
                .map((item, index) => {
                  return item.content(index);
                })}
            </div>
          </div>
        </div>
      </div>
    </section>
  );
}
